{
    "personal": {
        "reading":[
            {
                "title": "The Quiet Rise of Introverts", 
                "subTitle": null, 
                "author": "Brenda Knowles",
                "category": "Health & Wellness", 
                "subCategory": "Psychology & Mental Health", 
                "summary": "Many introverts in our world: More and more, people are identifying as introverts. Studies show that at least one-third of the people we encounter in our lives are introverts.\n\nIntroverts and relationships: The Quiet Rise of Introverts: 8 Practices for Loving and Living in a Noisy World is a guide to help tenderhearted and introverted individuals grow and nurture their peace, purpose, and relationships.\n\nMany types of introverts: There are many facets to being an introvert and many variations to each type. But as you peel back the layers to all these you quickly learn that introverts may make up 50 percent of the world's population.\n\nIntroverts and sensitivity: Author, speaker, and life coach Brenda Knowles presents eight unique practices to help readers learn that they are not alone or flawed in their sensitivity and introversion. Certified as a Myers-Briggs practitioner, she has been writing and guiding introverts for five years in space2live and has provided training as a family mediator. Incorporating the Eight Practices into your life yields a calmer sense of self, a deeper understanding of mental and physical self-care, an embracing of positive conflict, growth in responsiveness, and the secret to healing every day.", 
                "status": "in-progress"
            },
            {
                "title": "Beyond Training",
                "subTitle": "Mastering Endurance, Health & Life", 
                "author": "Ben Greenfield", 
                "category": "Health & Wellness", 
                "subCategory": "Fitness, Diet & Nutrition", 
                "summary": "Discover little-known nutrition and lifestyle tactics with Beyond Training!\n\nWhat problems does Beyond Training solve?\n\nIronically, many people who appear to be fit and healthy on the outside struggle with health and lifestyle issues like insomnia, gas, bloating, low libido, aging too fast, injuries, performance plateaus, brain fog, and a basic lack of time for their career, family, and friends. So, this book supplies a step-by-step guide to eliminating all these issues and helping you get the most out of life while still achieving amazing feats of physical performance.\n\nWho is Beyond Training for?\n\nBeyond Training is for men and women who have made it out of couch potato mode and are ready to take things to the next level, whether that means shedding those last few extra pounds, finishing a 5K, or even crossing the finish line of an Ironman triathlon. Everyone from the casual exerciser to the weightlifter, CrossFitter, obstacle racer, marathoner, mountaineer, triathlete, swimmer, cyclist, runner, and biohacker will glean tons of knowledge and life-changing advice from this book.\n\nWhat will Beyond Training do for you?\n\nBeyond Training educates and entertains with underground training, nutrition, and lifestyle tactics that mean no guesswork, less confusion about what to eat, and elimination of workout frustrations so you can have more time and make more money, experience fewer frustrating health issues, have complete confidence that you are training the right way, and rid yourself of notorious body trouble spots, nagging injuries, and stubborn body fat.", 
                "status": "in-progress"
            }, 
            {
                "title": "David and Goliath", 
                "subTitle": "Underdogs, Misfits, and the Art of Battling Giants",
                "author": "Malcolm Gladwell", 
                "category": "Health & Wellness", 
                "subCategory": "Psychology & Mental Health", 
                "summary": "Three thousand years ago, on a battlefield in ancient Palestine, a shepherd boy felled a mighty warrior with nothing more than a stone and a sling, and ever since then the names of David and Goliath have stood for battles between underdogs and giants. David's victory was improbable and miraculous. He shouldn't have won.\n\nOr should he have?\n\nIn David and Goliath, Malcolm Gladwell challenges how we think about obstacles and disadvantages, offering a new interpretation of what it means to be discriminated against, or cope with a disability, or lose a parent, or attend a mediocre school, or suffer from any number of other apparent setbacks. \n\nGladwell begins with the real story of what happened between the giant and the shepherd boy those many years ago. From there, David and Goliath examines Northern Ireland's Troubles, the minds of cancer researchers and civil rights leaders, murder and the high costs of revenge, and the dynamics of successful and unsuccessful classrooms - all to demonstrate how much of what is beautiful and important in the world arises from what looks like suffering and adversity.\n\nIn the tradition of Gladwell's previous best sellers, David and Goliath draws upon history, psychology, and powerful storytelling to reshape the way we think about the world around us.",
                "status": "in-progress"
            },
            {
                "title": "Barking up the Wrong Tree: The Surprising Science Behind Why Everything you  Know About Success is (Mostly) Wrong", 
                "author": "Eric Barker", 
                "category": "Business & Careers", 
                "subCategory": " Career Success", 
                "summary": "Much of the advice we've been told about achievement is logical, earnest...and downright wrong. In Barking up the Wrong Tree, Eric Barker reveals the extraordinary science behind what actually determines success and, most importantly, how anyone can achieve it. You'll learn:\n\n Why valedictorians rarely become millionaires and how your biggest weakness might actually be your greatest strength\nWhether nice guys finish last and why the best lessons about cooperation come from gang members, pirates, and serial killers\nWhy trying to increase confidence fails and how Buddhist philosophy holds a superior solution\nThe secret ingredient to \"grit\" that Navy SEALs and disaster survivors leverage to keep going.\n\nHow to find work-life balance using the strategy of Genghis Khan, the errors of Albert Einstein, and a little lesson from Spider-Man\n\nBy looking at what separates the extremely successful from the rest of us, we learn what we can do to be more like them - and find out, in some cases, why it's good that we aren't. Barking up the Wrong Tree draws on startling statistics and surprising anecdotes to help you understand what works and what doesn't, so you can stop guessing at success and start living the life you want.", 
                "status": "in-progress"
            },
            {
                "title": "Caffeine", 
                "subTitle": "How Caffeine Created the Modern World", 
                "category": "Health & Wellness",
                "subCategory": "Food & Wine", 
                "author": "Michael Pollan", 
                "summary": "Michael Pollan, known for his best-selling nonfiction audio, including The Omnivores Dilemma and How to Change Your Mind, conceived and wrote Caffeine: How Caffeine Created the Modern World as an Audible Original. In this controversial and exciting listen, Pollan explores caffeine’s power as the most-used drug in the world—and the only one we give to children (in soda pop) as a treat.\n\nPollan takes us on a journey through the history of the drug, which was first discovered in a small part of East Africa and within a century became an addiction affecting most of the human species. Caffeine, it turns out, has changed the course of human history—won and lost wars, changed politics, dominated economies. What’s more, the author shows that the Industrial Revolution would have been impossible without it. The science of how the drug has evolved to addict us is no less fascinating. And caffeine has done all these things while hiding in plain sight! Percolated with Michael Pollan’s unique ability to entertain, inform, and perform, Caffeine is essential listening in a world where an estimated two billion cups of coffee are consumed every day.", 
                "status": "completed"
            }, 
            {
                "title": "Grit", 
                "subTitle": "The Power of Passion and Perseverance", 
                "author": "Angela Duckworth", 
                "category": "Business & Careers", 
                "subCategory": " Career Success", 
                "summary": "n this must-listen book for anyone striving to succeed, pioneering psychologist Angela Duckworth shows parents, educators, students, and businesspeople - both seasoned and new - that the secret to outstanding achievement is not talent but a focused persistence called \"grit\".\n\nWhy do some people succeed and others fail? Sharing new insights from her landmark research on grit, MacArthur \"genius\" Angela Duckworth explains why talent is hardly a guarantor of success. Rather, other factors can be even more crucial, such as identifying our passions and following through on our commitments.\n\nDrawing on her own powerful story as the daughter of a scientist who frequently bemoaned her lack of smarts, Duckworth describes her winding path through teaching, business consulting, and neuroscience, which led to the hypothesis that what really drives success is not genius but a special blend of passion and long-term perseverance. As a professor at the University of Pennsylvania, Duckworth created her own \"character lab\" and set out to test her theory.\n\nHere, she takes listeners into the field to visit teachers working in some of the toughest schools, cadets struggling through their first days at West Point, and young finalists in the National Spelling Bee. She also mines fascinating insights from history and shows what can be gleaned from modern experiments in peak performance. Finally, she shares what she's learned from interviewing dozens of high achievers - from J.P. Morgan CEO Jamie Dimon to the cartoon editor of The New Yorker to Seattle Seahawks coach Pete Carroll.\n\nWinningly personal, insightful, and even life changing, Grit is a book about what goes through your head when you fall down and how that - not talent or luck - makes all the difference.", 
                "status": "in-progress"
            },
            {
                "title": "Your Best Brain", 
                "subTitle": "The Science of Brain Improvement", 
                "category": "Health & Wellness", 
                "subCategory": "Psychology & Mental Health", 
                "author": "John Medina", 
                "summary": "Inside your head sits the most complex object in the known universe - the human brain. This amazing organ has unique powers to make predictions about the future, form relationships with other people, adapt to rapidly changing circumstances, and so much more. We all have a basic conception of how our brains function, but when did you last dive into the fascinating world of neuroscience to truly understand the inner workings of your mind?\n\nFor decades, the field of neuroscience has been in a near-constant state of disruptive transformation, as we continually learn more about our incredible brains. Thanks to rapid advances in technology and in our understanding of the brain, today’s neuroscience research goes far beyond trying to understand how the brain works, and into the search for proven ways to optimize brain performance. In Your Best Brain, Professor John J. Medina - an award-winning scientist, New York Times best-selling author, and leading advocate for brain research - delivers 24 exciting lectures that probe the origins of consciousness, memory, emotion, attention, intelligence, and beyond. He focuses on five key areas of study in neuroscience: the brain’s physical structure and function, and how it enabled us to become the planet’s apex predator; the ways in which the brain processes information, and how that relates to intelligence; the intricacies of emotions and socialization, and how empathy is a vital survival mechanism; how our brains develop and change throughout our lifetimes; and how we can best use and expand our cerebral processing performance. After gaining a thorough understanding of the science behind your best brain, you’ll learn scientifically proven methods for improving your memory, boosting your creativity, and keeping your mind sharp for years to come.", 
                "status": "in-progress"
            },
            {
                "title": "Peak Performance", 
                "subTitle":"Elevate Your Game, Avoid Burnout, and Thrive with the New Science of Success", 
                "author": "Brad Stulberg , Steve Magness", 
                "category": "Business & Careers", 
                "subCategory": " Career Success", 
                "summary": "A few common principles drive performance, regardless of the field or the task at hand. Whether someone is trying to qualify for the Olympics, break ground in mathematical theory or craft an artistic masterpiece, many of the practices that lead to great success are the same. In Peak Performance, Brad Stulberg, a former McKinsey and Company consultant and journalist who covers health and the science of human performance, and Steve Magness, a performance scientist and coach of Olympic athletes, team up to demystify these practices and demonstrate how everyone can achieve their best.\n\nThe first book of its kind, Peak Performance combines the inspiring stories of top performers across a range of capabilities - from athletic, to intellectual, to artistic - with the latest scientific insights into the cognitive and neurochemical factors that drive performance in all domains. In doing so, Peak Performance uncovers new linkages that hold promise as performance enhancers but have been overlooked in our traditionally-siloed ways of thinking. The result is a life-changing book in which listeners will learn how to enhance their performance via myriad ways including: optimally alternating between periods of intense work and rest; developing and harnessing the power of a self-transcending purpose; and priming the body and mind for enhanced productivity.\n\nIn revealing the science of great performance and the stories of great performers across a wide range of capabilities, Peak Performance uncovers the secrets of success, and coaches listeners on how to use them. If you want to take your game to the next level, whatever \"your game\" may be, Peak Performance will teach you how.",
                "status": "complete"
            },
            {
                "title": "Indistractable: How to Control Your Attention and Choose Your Life", 
                "subTitle": "How to Control Your Attention and Choose Your Life",
                "author": "Nir Eyal , Julie Li", 
                "category": "Business & Careers", 
                "subCategory": " Career Success", 
                "summary": "You sit down at your desk to work on an important project, but a notification on your phone interrupts your morning. Later, as you're about to get back to work, a colleague taps you on the shoulder to chat. At home, screens get in the way of quality time with your family. Another day goes by, and once again, your most important personal and professional goals are put on hold.\n\nWhat would be possible if you followed through on your best intentions? What could you accomplish if you could stay focused and overcome distractions? What if you had the power to become \"indistractable\"?\n\nInternational best-selling author, former Stanford lecturer, and behavioral design expert, Nir Eyal, wrote Silicon Valley's handbook for making technology habit-forming. Five years after publishing Hooked, Eyal reveals distraction's Achilles' heel in his groundbreaking new book.\n\nIn Indistractable, Eyal reveals the hidden psychology driving us to distraction. He describes why solving the problem is not as simple as swearing off our devices: Abstinence is impractical and often makes us want more. \n\nEyal lays bare the secret of finally doing what you say you will do with a four-step, research-backed model. Indistractable reveals the key to getting the best out of technology, without letting it get the best of us. \n\nInside, Eyal overturns conventional wisdom and reveals: \n\nWhy distraction at work is a symptom of a dysfunctional company culture - and how to fix it\nWhat really drives human behavior and why \"time management is pain management\"\nWhy your relationships (and your sex life)depend on you becoming indistractable\nHow to raise indistractable children in an increasingly distracting world\n\nEmpowering and optimistic, Indistractable provides practical, novel techniques to control your time and attention - helping you live the life you really want.", 
                "status": "in-progress"
            },
            {
                "title": "Everything Is Figureoutable", 
                "subTitle": null, 
                "author": "Marie Forleo", 
                "category": "Business & Careers", 
                "subCategory": " Career Success", 
                "summary": "While most self-help books offer quick fixes, Everything is Figureoutable will retrain your brain to think more creatively and positively in the face of setbacks. In the words of Cheryl Strayed, it’s “a must-read for anyone who wants to face their fears, fulfill their dreams, and find a better way forward.”\n\nIf you’re having trouble solving a problem or reaching a dream, the problem isn’t you. It’s that you haven’t yet installed the one belief that changes everything.\n\nMarie’s mom once told her, “Nothing in life is that complicated. You can do whatever you set your mind to if you roll up your sleeves. Everything is figureoutable.”\n\nWhether you want to leave a dead end job, break an addiction, learn to dance, heal a relationship, or grow a business, Everything is Figureoutable will show you how.\n\n You’ll learn:\n\nThe habit that makes it 42 percent more likely you’ll achieve your goals.\nHow to overcome a lack of time and money.\nHow to deal with criticism and imposter syndrome.\nIt’s more than just a fun phrase to say. It’s a philosophy of relentless optimism. A mindset. A mantra. A conviction.\n\nMost important, it’s about to make you unstoppable. ", 
                "status": "in-progress"
            }, 
            {
                "title": "Atomic Habbits", 
                "subTitle": "An Easy & Proven Way to Build Good Habits & Break Bad Ones", 
                "author": "James Clear",
                "category": "Business & Careers", 
                "subCategory": "Workplace & Organizational Behavior", 
                "summary": "No matter your goals, Atomic Habits offers a proven framework for improving - every day. James Clear, one of the world's leading experts on habit formation, reveals practical strategies that will teach you exactly how to form good habits, break bad ones, and master the tiny behaviors that lead to remarkable results.\n\nIf you're having trouble changing your habits, the problem isn't you. The problem is your system. Bad habits repeat themselves again and again not because you don't want to change, but because you have the wrong system for change. You do not rise to the level of your goals. You fall to the level of your systems. Here, you'll get a proven system that can take you to new heights.\n\nClear is known for his ability to distill complex topics into simple behaviors that can be easily applied to daily life and work. Here, he draws on the most proven ideas from biology, psychology, and neuroscience to create an easy-to-understand guide for making good habits inevitable and bad habits impossible. Along the way, listeners will be inspired and entertained with true stories from Olympic gold medalists, award-winning artists, business leaders, life-saving physicians, and star comedians who have used the science of small habits to master their craft and vault to the top of their field.Learn how to:\n\nmake time for new habits (even when life gets crazy);\novercome a lack of motivation and willpower; \ndesign your environment to make success easier;\nget back on track when you fall off course;\nand much more. \n\nAtomic Habits will reshape the way you think about progress and success, and give you the tools and strategies you need to transform your habits - whether you are a team looking to win a championship, an organization hoping to redefine an industry, or simply an individual who wishes to quit smoking, lose weight, reduce stress, or achieve any other goal.", 
                "status": "complete"
            },
            {
                "title": "Dear Girls", 
                "subTitle": "Intimate Tales, Untold Secrets & Advice for Living Your Best Life", 
                "author": "Ali Wong",
                "category": "Biographies & Memoirs", 
                "subCategory": "Entertainment & Celebrities", 
                "summary": "Ali Wong's heartfelt and hilarious letters to her daughters (the two she put to work while they were still in utero) covering everything they need to know in life, like the unpleasant details of dating, how to be a working mom in a male-dominated profession, and how she trapped their dad.", 
                "status": "complete"
            },
            {
                "title": "The Burnout Generation", 
                "subTitle": null, 
                "author": "Anne Helen Petersen",
                "category": "Health & Wellness", 
                "subCategory": "Psychology & Mental Health", 
                "summary": "In January 2019, culture writer Anne Helen Petersen set the Internet on fire with her viral BuzzFeed essay diagnosing \"millennial burnout\"—a chronic state of stress and exhaustion that’s become a \"base temperature\" for young people today. Now, she continues this generation-defining conversation in a brand-new format, interviewing millennials around the country about their own deeply personal experiences with burnout and the culture that creates it. Listeners will hear about how this issue has affected Petersen’s own life as well as the lives of five very different subjects: Kevin, a musician and Marine veteran; Kate, a first-generation college graduate working to repay her formidable student debt; Haley and Evette, young writers at different career stages in the digital media industry; and John, a pastor and co-founder of a new Baptist church in North Carolina.\n\nThe conversations that comprise The Burnout Generation cover everything from debt to social media to the blurred boundaries between our professional and personal lives. In this illuminating and intimate audio project, listeners learn how and why this generation has been conditioned to \"optimize\" every aspect of our lives (Meal prep for the week! Find a side hustle! But practice self-care! And answer emails in bed!), and most importantly, how the consequences of this phenomenon play out in day-to-day life.", 
                "status": "complete"
            },
            {
                "title": "13 Things Mentally Strong People Don't Do",
                "subTitle": "Take Back Your Power, Embrace Change, Face Your Fears, and Train Your Brain for Happiness and Success", 
                "author": "Amy Morin",
                "category": "Business & Careers", 
                "subCategory": " Career Success", 
                "summary": "Everyone knows that regular exercise and weight training lead to physical strength. But how do we strengthen ourselves mentally for the truly tough times? And what should we do when we face these challenges? Or as psychotherapist Amy Morin asks, what should we avoid when we encounter adversity? Through her years counseling others and her own experiences navigating personal loss, Morin realized it is often the habits we cannot break that are holding us back from true success and happiness. Indulging in self-pity or agonizing over things beyond our control, obsessing over past events, resenting the achievements of others, or expecting immediate positive results all hold us back.\n\nNow, for the first time, Morin expands upon the 13 Things from her viral post and shares her tried-and-true practices for increasing mental strength. Increasing your mental strength can change your entire attitude. It takes practice and hard work, but with Morin's specific tips, exercises, and troubleshooting advice, it is possible to not only fortify your mental muscle but also drastically improve the quality of your life.", 
                "status": "in-progress"
            }
        ], 
        "funFacts": [
            {
                "fact": "for fun, I stripped my first car's interior material off, insulated the entire cabin, and put it back together, installed a new stereo in the dash, new speakers throughout the car, and wired them all to new amps and subwoofers, and replaced all the lighting with LEDs and HID (for the headlights)", 
                "category": "automotive"
            }
        ], 
        "bucketList": {
            "fitness": [
                {
                    "goal": "run a mile in less than 6 minutes", 
                    "status": "completed"
                },
                {
                    "goal": "run a 10k in less than 18 minutes", 
                    "status": "completed"
                }, 
                {
                    "goal": "run a half marathon",
                    "status": "todo"
                }, 
                {
                    "goal": "run a marathon", 
                    "status": "todo" 
                }
            ],
            "experiences": [
                {
                    "goal": "drive a german car on the autobon, in Germany", 
                    "status": "todo" 
                }, 
                {
                    "goal": "tour La Sagrada Familia", 
                    "status": "todo" 
                }, 
                {
                    "goal": "tour la Vatican", 
                    "status": "todo"
                }
                {
                    "goal": "hike Yosemite", 
                    "status": "todo" 
                },
                {
                    "goal": "go on a cross-country road-trip", 
                    "status": "todo"
                }
            ], 
            "travel": [              
                {
                    "goal": "", 
                    "status": false 
                }
            ], 
            "education": [
                {
                    "goal": "graduate from college", 
                    "status": "completed"
                }
            ], 
            "programming": [
                {
                    "goal": "create a full-stack application", 
                    "status": "completed" 
                },
                {
                    "goal": "contribute to an open-source project", 
                    "status": "todo" 
                }
            ]
            
        }
    }
}